from .lesson import *

# 前面的索引代表课程提醒的某时刻，比如高数在早上8点开课，我要让机器人7.45提醒，那么索引就设置为7，目前最多同时支持两个班，

mon_switch_three = {  # 三班课表
    7: '高数'
    , 9: '英语'
    , 15: '大物'
}
tue_switch_three = {
    7: '中国近现代史'
    , 9: '离散数学'
    , 13: '大学生职业发展与就业指导'
    , 18: 'c++程序设计'
}
web_switch_three = {
    7: '高数'
    , 9: '英语'
    , 13: '创业基础'
    , 15: '体育'
}
thu_switch_three = {
    7: '离散数学'
    , 9: '中国近现代史'
    , 13: '大学物理'
    , 15: '心理课'
    , 18: 'c++程序设计'
}
fri_switch_three = {
    9: '英语听力'
    , 13: '高数'
}
# 课程所在平台
three_teach = {
                  '高数': '云班课'
                , '英语': '批改网或QQ群'
                , '大物': '物理QQ群'
                , '离散数学': '钉钉'
                , '英语听力': 'QQ群或批改网'
                , '心理课': '知道智慧树'
                , '中国近现代史': '‘学习通'
                , '创业基础': '钉钉'
                , 'c++程序设计': '腾讯课堂'
                , '体育': '各自的群组'
                , '大学生职业发展与就业指导': '知道智慧树'
               }  # 课程所在平台
# 6班课表
mon_switch_six = {
    7: '高数'
    , 13: '大物'
    , 15: '创业基础'}
tue_switch_six = {
    7: '高数'
    , 9: '心理课'
    , 13: '英语'
}
web_switch_six = {
    7: '高数'
    , 13: '中国近现代史'
}
thu_switch_six = {
    7: '离散数学'
    , 13: '英语'
    , 15: '英语听力'}
fri_switch_six = {
    7: '中国近现代史'
    , 9: '大学生职业发展与就业指导'
    , 13: '高数', 15: '大物'
    , 18: 'c++程序设计'}
sat_switch_six = {18: 'c++程序设计'}
